BasileBerckmoes/RobotComp2ELO/Roadster/Software/PSoc/Roadster/Roadster/Roadster1.0.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "LED5_aliases.h"
#include "LED5.h"
#include "LED4_aliases.h"
#include "LED4.h"
#include "LED3_aliases.h"
#include "LED3.h"
#include "LED2_aliases.h"
#include "LED2.h"
#include "LED1_aliases.h"
#include "LED1.h"
#include "SW1_aliases.h"
#include "SW1.h"
#include "IN3_aliases.h"
#include "IN3.h"
#include "IN2_aliases.h"
#include "IN2.h"
#include "LCD.h"
#include "IN1_aliases.h"
#include "IN1.h"
#include "ENB_aliases.h"
#include "ENB.h"
#include "ENA_aliases.h"
#include "ENA.h"
#include "Clock_1.h"
#include "MotorControl.h"
#include "IN4_aliases.h"
#include "IN4.h"
#include "BleVDAC.h"
#include "BleBuffer.h"
#include "BleUart.h"
#include "BleRxISR.h"
#include "BleKey_aliases.h"
#include "BleKey.h"
#include "BleState_aliases.h"
#include "BleState.h"
#include "RijRichting.h"
#include "LCD_LCDPort_aliases.h"
#include "LCD_LCDPort.h"
#include "BleUart_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

